http/results/retro2-classic-libev-R10000-r2.txt
Running 20s test @ http://127.0.0.1:19227/
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.176ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.883ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.905ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.911ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.76ms    1.23ms  19.52ms   89.25%
    Req/Sec     2.63k   472.68     5.90k    81.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.58ms
 75.000%    2.12ms
 90.000%    2.74ms
 99.000%    7.23ms
 99.900%   13.83ms
 99.990%   15.64ms
 99.999%   19.53ms
100.000%   19.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.091     0.000000            1         1.00
       0.752     0.100000         9876         1.11
       1.000     0.200000        19772         1.25
       1.202     0.300000        29664         1.43
       1.393     0.400000        39500         1.67
       1.582     0.500000        49371         2.00
       1.676     0.550000        54322         2.22
       1.774     0.600000        59259         2.50
       1.877     0.650000        64179         2.86
       1.991     0.700000        69106         3.33
       2.123     0.750000        74080         4.00
       2.197     0.775000        76538         4.44
       2.279     0.800000        79023         5.00
       2.369     0.825000        81485         5.71
       2.469     0.850000        83914         6.67
       2.593     0.875000        86406         8.00
       2.661     0.887500        87628         8.89
       2.739     0.900000        88865        10.00
       2.831     0.912500        90093        11.43
       2.933     0.925000        91330        13.33
       3.049     0.937500        92550        16.00
       3.127     0.943750        93172        17.78
       3.213     0.950000        93791        20.00
       3.323     0.956250        94405        22.86
       3.447     0.962500        95020        26.67
       3.617     0.968750        95642        32.00
       3.727     0.971875        95945        35.56
       3.855     0.975000        96251        40.00
       4.015     0.978125        96559        45.71
       4.303     0.981250        96870        53.33
       4.787     0.984375        97176        64.00
       5.155     0.985938        97331        71.11
       5.791     0.987500        97485        80.00
       6.519     0.989062        97639        91.43
       7.647     0.990625        97793       106.67
       8.671     0.992188        97947       128.00
       9.207     0.992969        98024       142.22
       9.679     0.993750        98102       160.00
      10.063     0.994531        98180       182.86
      10.647     0.995313        98256       213.33
      11.135     0.996094        98333       256.00
      11.391     0.996484        98371       284.44
      11.623     0.996875        98412       320.00
      11.943     0.997266        98449       365.71
      12.343     0.997656        98487       426.67
      12.727     0.998047        98527       512.00
      12.871     0.998242        98545       568.89
      13.055     0.998437        98564       640.00
      13.383     0.998633        98584       731.43
      13.727     0.998828        98603       853.33
      13.847     0.999023        98622      1024.00
      13.975     0.999121        98632      1137.78
      14.087     0.999219        98641      1280.00
      14.231     0.999316        98651      1462.86
      14.351     0.999414        98662      1706.67
      14.479     0.999512        98670      2048.00
      14.543     0.999561        98675      2275.56
      14.735     0.999609        98680      2560.00
      14.807     0.999658        98685      2925.71
      14.879     0.999707        98690      3413.33
      15.063     0.999756        98694      4096.00
      15.159     0.999780        98697      4551.11
      15.303     0.999805        98699      5120.00
      15.463     0.999829        98702      5851.43
      15.503     0.999854        98704      6826.67
      15.591     0.999878        98706      8192.00
      15.639     0.999890        98708      9102.22
      15.671     0.999902        98709     10240.00
      15.679     0.999915        98710     11702.86
      15.695     0.999927        98711     13653.33
      15.951     0.999939        98712     16384.00
      19.407     0.999945        98713     18204.44
      19.471     0.999951        98714     20480.00
      19.471     0.999957        98714     23405.71
      19.487     0.999963        98715     27306.67
      19.487     0.999969        98715     32768.00
      19.519     0.999973        98716     36408.89
      19.519     0.999976        98716     40960.00
      19.519     0.999979        98716     46811.43
      19.535     0.999982        98718     54613.33
      19.535     1.000000        98718          inf
#[Mean    =        1.761, StdDeviation   =        1.227]
#[Max     =       19.520, Total count    =        98718]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  197069 requests in 20.00s, 398.06MB read
Requests/sec:   9852.77
Transfer/sec:     19.90MB

JSON Output:
{
	"requests": 197069,
	"duration_in_microseconds": 20001372.00,
	"bytes": 417392142,
	"requests_per_sec": 9852.77,
	"bytes_transfer_per_sec": 20868175.54,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1582
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2123
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 2739
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 7227
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 13831
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 15639
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 19535
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 19535
		}
	]
}