http/results/retro2-classic-libev-R20000-r2.txt
Running 20s test @ http://127.0.0.1:19229/
  4 threads and 100 connections
  Thread calibration: mean lat.: 3.644ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 3.719ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 3.682ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 3.660ms, rate sampling interval: 19ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.03ms    2.99ms  29.68ms   91.43%
    Req/Sec     5.14k   768.51     9.67k    83.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.30ms
 75.000%    3.01ms
 90.000%    4.68ms
 99.000%   15.49ms
 99.900%   27.25ms
 99.990%   29.09ms
 99.999%   29.49ms
100.000%   29.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.075     0.000000            1         1.00
       1.153     0.100000        19774         1.11
       1.566     0.200000        39538         1.25
       1.840     0.300000        59273         1.43
       2.079     0.400000        79113         1.67
       2.303     0.500000        98787         2.00
       2.419     0.550000       108671         2.22
       2.543     0.600000       118587         2.50
       2.677     0.650000       128397         2.86
       2.831     0.700000       138345         3.33
       3.007     0.750000       148170         4.00
       3.109     0.775000       153094         4.44
       3.229     0.800000       158031         5.00
       3.375     0.825000       162973         5.71
       3.577     0.850000       167902         6.67
       3.877     0.875000       172806         8.00
       4.139     0.887500       175297         8.89
       4.675     0.900000       177751        10.00
       5.807     0.912500       180215        11.43
       7.155     0.925000       182685        13.33
       8.495     0.937500       185165        16.00
       9.047     0.943750       186386        17.78
       9.807     0.950000       187625        20.00
      10.535     0.956250       188859        22.86
      11.231     0.962500       190087        26.67
      12.151     0.968750       191327        32.00
      12.583     0.971875       191945        35.56
      13.071     0.975000       192563        40.00
      13.447     0.978125       193180        45.71
      13.863     0.981250       193796        53.33
      14.391     0.984375       194416        64.00
      14.663     0.985938       194720        71.11
      14.959     0.987500       195024        80.00
      15.303     0.989062       195335        91.43
      15.607     0.990625       195649       106.67
      15.975     0.992188       195950       128.00
      16.351     0.992969       196108       142.22
      16.863     0.993750       196258       160.00
      17.439     0.994531       196413       182.86
      18.271     0.995313       196568       213.33
      20.143     0.996094       196722       256.00
      21.247     0.996484       196798       284.44
      22.079     0.996875       196875       320.00
      23.743     0.997266       196952       365.71
      24.991     0.997656       197031       426.67
      25.599     0.998047       197108       512.00
      26.047     0.998242       197145       568.89
      26.447     0.998437       197186       640.00
      26.639     0.998633       197223       731.43
      26.895     0.998828       197261       853.33
      27.295     0.999023       197301      1024.00
      27.391     0.999121       197319      1137.78
      27.535     0.999219       197338      1280.00
      27.855     0.999316       197358      1462.86
      27.999     0.999414       197378      1706.67
      28.287     0.999512       197396      2048.00
      28.415     0.999561       197406      2275.56
      28.495     0.999609       197415      2560.00
      28.607     0.999658       197425      2925.71
      28.703     0.999707       197435      3413.33
      28.783     0.999756       197446      4096.00
      28.799     0.999780       197449      4551.11
      28.863     0.999805       197456      5120.00
      28.927     0.999829       197460      5851.43
      29.023     0.999854       197465      6826.67
      29.055     0.999878       197469      8192.00
      29.071     0.999890       197471      9102.22
      29.087     0.999902       197473     10240.00
      29.135     0.999915       197478     11702.86
      29.135     0.999927       197478     13653.33
      29.183     0.999939       197481     16384.00
      29.199     0.999945       197482     18204.44
      29.231     0.999951       197483     20480.00
      29.311     0.999957       197484     23405.71
      29.327     0.999963       197485     27306.67
      29.359     0.999969       197486     32768.00
      29.375     0.999973       197488     36408.89
      29.375     0.999976       197488     40960.00
      29.375     0.999979       197488     46811.43
      29.455     0.999982       197489     54613.33
      29.455     0.999985       197489     65536.00
      29.487     0.999986       197490     72817.78
      29.487     0.999988       197490     81920.00
      29.487     0.999989       197490     93622.86
      29.583     0.999991       197491    109226.67
      29.583     0.999992       197491    131072.00
      29.583     0.999993       197491    145635.56
      29.583     0.999994       197491    163840.00
      29.583     0.999995       197491    187245.71
      29.695     0.999995       197492    218453.33
      29.695     1.000000       197492          inf
#[Mean    =        3.033, StdDeviation   =        2.987]
#[Max     =       29.680, Total count    =       197492]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  394105 requests in 20.00s, 796.05MB read
Requests/sec:  19704.01
Transfer/sec:     39.80MB

JSON Output:
{
	"requests": 394105,
	"duration_in_microseconds": 20001262.00,
	"bytes": 834714390,
	"requests_per_sec": 19704.01,
	"bytes_transfer_per_sec": 41733086.14,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 2303
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 3007
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 4675
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 15495
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 27247
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 29087
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 29487
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 29695
		}
	]
}